// Tactic: Credential Access | Technique: T1003 OS Credential Dumping (LSASS)
let lsassNames = dynamic(["lsass.exe"]);
DeviceProcessEvents
| where Timestamp > ago(lookback)
| where (FileName in~ ("procdump.exe","rundll32.exe","comsvcs.dll","lsassy.exe","mimikatz.exe"))
   or (ProcessCommandLine has_all ("rundll32","comsvcs","MiniDump"))
| project Timestamp, DeviceName, FileName, ProcessCommandLine, InitiatingProcessFileName
union (
DeviceImageLoadEvents
| where Timestamp > ago(lookback)
| where InitiatingProcessFileName in~ (lsassNames) and FileName in~ ("dbghelp.dll","comsvcs.dll")
| project Timestamp, DeviceName, InitiatingProcessFileName, FileName, FolderPath)
