// Tactic: Execution | Technique: T1047 Windows Management Instrumentation
DeviceProcessEvents
| where FileName in~ ("wmic.exe") or ProcessCommandLine has_any ("Win32_Process","/node:","/user:")
| project Timestamp, DeviceName, FileName, ProcessCommandLine, InitiatingProcessFileName, InitiatingProcessCommandLine
